const data = {
    subjects: {
        grammer: {
            name: "النحو والصرف",
            professors: [
                "أ.د منصور عبدالسميع"
            ],
            documents: [
                {
                    title: "المقرر الإلكتروني",
                    type: "pdf",
                    path: "docs/مقرر%20النحو%20والصرف%20لطلاب%20الفرقة%20الرابعة%20قسم%20اللغة%20العربية%202022_2023.pdf"
                },
                {
                    title: "امتحان 2022",
                    type: "photo",
                    path: "docs/امتحان%20النحو%20والصرف%202022%20-%20الفرقة%20الرابعة%20آداب%20قسم%20اللغة%20العربية.jpg"
                },
                {
                    title: "امتحان 2022 (الخلف)",
                    type: "photo",
                    path: "docs/امتحان%20النحو%20والصرف%202022%20(الخلف)%20-%20الفرقة%20الرابعة%20آداب%20قسم%20اللغة%20العربية.jpg"
                },
                {
                    title: "امتحان 2019",
                    type: "photo",
                    path: "docs/امتحان%20النحو%20والصرف%202019%20-%20الفرقة%20الرابعة%20آداب%20قسم%20اللغة%20العربية.jpg"
                },
                {
                    title: "امتحان 2019 (الخلف)",
                    type: "photo",
                    path: "docs/امتحان%20النحو%20والصرف%202019%20(الخلف)%20-%20الفرقة%20الرابعة%20آداب%20قسم%20اللغة%20العربية.jpg"
                },
                {
                    title: "امتحان 2018",
                    type: "photo",
                    path: "docs/امتحان%20النحو%20والصرف%202018%20-%20الفرقة%20الرابعة%20آداب%20قسم%20اللغة%20العربية.jpg"
                },
                {
                    title: "امتحان 2018 (الخلف)",
                    type: "photo",
                    path: "docs/امتحان%20النحو%20والصرف%202018%20(الخلف)%20-%20الفرقة%20الرابعة%20آداب%20قسم%20اللغة%20العربية.jpg"
                },
                {
                    title: "امتحان 2014",
                    type: "photo",
                    path: "docs/امتحان%20النحو%20والصرف%202014%20-%20الفرقة%20الرابعة%20آداب%20قسم%20اللغة%20العربية.jpg"
                },
                {
                    title: "امتحان 2014 (الخلف)",
                    type: "photo",
                    path: "docs/امتحان%20النحو%20والصرف%202014%20(الخلف)%20-%20الفرقة%20الرابعة%20آداب%20قسم%20اللغة%20العربية.jpg"
                }
            ],
            notes: [
                "الرجاء الإلتزام بالحضور مبكراً، كما أنه يتم سؤال المتأخرين ومناقشتهم.",
                "كتاب شرح ابن عقيل (الأربعة أجزاء) موجود في مكتبة الفتح بـ 120ج.",
                "التكليفات عليها درجات أعمال السنة."
            ],
            events: [
                {
                    title: "المحاضرة الرابعة عشرة :check:",
                    full_date: "السبت 18/02/2023 08:00 ص",
                    content: [
                        "<h4>أنَّ</h4><p>↩ تأتي وسط الكلام.</p><h4>إِنَّ</h4><p>↩ تدخل على الجملة الإسمية، والعمل هو التوكيد والنصب وتأتي في أول الكلام.</p><h4>إِنْ</h4><p>↩ شرطية عملها الجزم.</p><h4>أَنْ</h4><p>↩ ناصبة للفعل المضارع (تنصبه في الغالب).</p><p>* تمنيت أنْ تنجحَ. ← منصوبة لأنه شيء غير ثابت أو متحقق.</p><br><p>* علمت أنْ تنجحُ. ← مرفوعة لأنة شيء ثابت ومتحقق.</p><p>↩ (تيقنت)</p><p>↩ البصريون عندهم (أَنْ) مخففة، وأصل الكلام ← علمت *أنّك* تنجحُ (ثقيلة).</p><br><h4>إذن</h4><p>* إذن أكرمَك ← منصوبة لأنها متصدرة.</p><p>* أنا إذن أكرمُك ← مرفوعة لأنها غير متصدرة.</p><p>* إذن أنا أكرمُك ← مرفوعة لأن (أنا) فصلت بينها، وأبطل فعل إذن.</p><br><p>* سرت حتى أدخلُ المدينة. ← حققت الدخول.</p><p>* سرت حتى أدخلَ المدينة. ← لم يتحقق الدخول.</p><br><h4>الفاء</h4><ul><li>دلالة الإستقبال</li><li>طلب محض أو نفي محض</li><li>وجود فاء دالة على السببية</li></ul><p>* ما حضر محمد ← نفي محض.</p><p>* ما حضر إلا محمد ← نفي غير محض.</p><p>* الأساليب الإنشائية: (أمر - دعاء - نهي - استفهام - تمني - عرض - تحضيض - *وأضاف الكوفيون الترجي*) أجوبة الثمانية.</p><p>* طلب غير محض ← اسم فعل الأمر (صه، صه) *صيغة اسمية*.</p><br><h4>الواو</h4><ul><li>دلالة الإستقبال</li><li>طلب محض أو نفي محض</li><li>وجود واو دالة على المعية</li></ul>",
                        "<p>* سار (س ي ر) ← ساير (اسم فاعل) ← سائر.</p><p>↩ اسم مفعول ← مسيوْر ← مَسِير.</p><p>* أيقن (أفعل) ← يُيْقن (يفعل) ← يوقن.</p><p>↩ اسم فاعل (ميم مضمومة وكسر ما قبل الآخر) ← مُوقِن.</p><p>↩ اسم مفعول ← مُوقَن (فتح ما قبل الآخر).</p>",
                        "<h4>تكليف</h4><ul><li>هات الأصل ثم المضارع ثم اسم الفاعل من: نال / شاد / رمى / افترى / استلقى / أبكى / ألقى / استهدى</li><li>نأتي بالمضارع من: أيقظ / أينع / أيسر</li></ul><br><p>* قراءة ومذاكرة من ص14 حتى ص19 (ونسأل فيما يصعب فهمه بعد بحث أولاً).</p>"
                    ]
                },
                {
                    title: "المحاضرة الثالثة عشرة :check:",
                    full_date: "السبت 11/02/2023 08:00 ص",
                    content: [
                        '<p>* تم الشرح من الفصل الأول "مفاهيم نحوية حاكمة" ص2 إلى ص9 "أن".</p><p>* كان أحدهم يفتي الناس من كتاب سيبويه مثل "حُكم إذا نسي أحدهم سجود السهو" فكان يقول: "لا شيء عليه" ودليله من كتاب سيبويه؛ المُصغر لا يُصغر.</p><br><p>* صحيفة ← (نجمعها بإضافة ألف ثالثة) ← صحايف ← صحائف (وقعت الياء بعد الألف الزائدة فتحول همزة).</p><p>* صائد ← صاائد (نلاحظ إلتقاء ساكنين) ← *لن تستطيع الحذف لأن حذف الألف الأولى يحولها إلى صيْد وهذه مصدر، والألف الثانية تدل على الجمع فلا يجوز*</p><p>↩ فتكون ← صوائد (من حمل النقيض على النقيض) *التصغير نقيض الجمع مثل صائد ← صايئد ← صويئد*.</p><br><p>* قوي (مصدرها قوّة *قُوْوَة الهاء للتأنيث*) ← (أصلها) ← قوو (قلبت الواو الثانية ياء لمناسبة الكسرة قبلها).</p><p>↩ اسم المفعول منها ← مَقْوُوو (مفعول) ← *نحذف أم نغير؟*</p><p>↩ لا نحذف لأن هناك واو من أصل الفعل. *إذاً سنغير ولكن ماذا؟*</p><p>↩ الواو الأولى لا يمكن تغييرها، إذاً نختار ما بين الثانية والثالثة؛ الطرف هو الأضعف *الأضعف هو الذي يتغير*.</p><p>↩ نغيرها إلى ماذا؟ ← (ألف أم واو أم همزة) ← مقووي (يصعب كل شيء عدا الياء) ← مقوي ي (إذا اجتمع واو وياء أولهما ساكن، تُقلب الواو ياء ثم تُضغم في الياء الثانية) ← مقويّ.</p><p>* رضي (رضو) ← (مفعول) ← مَرْضُوو ← مَرْضوي ← مرضيّ.</p><br><p>* بنى ← بِنَاْيْ (فِعال) ← بناء (وقعت الياء طرفاً بعد ألف مد زائدة، فتُقلب همزة ومثلها الواو).</p><p>* باع ← بايع ← بائع.</p><p>* قال (قول) ← قاول ← قائل.</p>',
                        "<h4>تكليف</h4><ul><li>جمع تكسير من: غريزة / عجيبة / سليقة / شعيرة / سريرة / خميلة / قبيلة / عقيدة / نفيسة / ذخيرة / سائل / مائدة / نائف</li><li>صيغة (فِعال) من: قضى / جزى / بكى / فنى / بقى / عوى</li><li>المصدر من: انقضى / افترى</li><li>اسم الفاعل من: هام / زاغ / مال / حاد / غاب / باد / كاد / غاظ / بان / صاد / طاش</li></ul>"
                    ]
                },
                {
                    title: "المحاضرة الثانية عشرة :check:",
                    full_date: "السبت 17/12/2022 08:00 ص",
                    content: [
                        "<h4>اسم فاعل من فعل ثلاثي</h4><p>* قال ← قاول ← قائل (وقعت الواو عيناً لاسم الفاعل، فقُلبت الواو همزة).</p><p>* صام ← صائم.</p><p>* قام ← قائم.</p><p>* غار ← غائر.</p><br><p>* عجوز ← عجاوز ← عجائز.</p><br><p>* قال ← (الأصل) ← قول.</p><p>* محا ← (الأصل) ← محو.</p><br><h4>جمع فاعلة على فواعل</h4><p>* واصلة ← وواصل ← أواصل (اجتمعت واوان الثانية منهما متحركة، فتقلب الأولى همزة).</p><br><p>* عائدة ← عواود ← عوائد.</p><p>* شائبة ← شوائب.</p><p>* سيد ← سييد ← سيايد ← سيائد.</p><br><p>* قام ← (المصدر) ← قِوام ← قيام (تأثراً بالكسرة).</p><br><p>* حوض ← (أصله) ← حِواض ← حياض (تأثرت الواو بالكثرة).</p><p>* وَزَن ← مِوْازن ← ميزان.</p>",
                        "<h4>تكليف</h4><ul><li>وضح ما حدث من إعلال أو إبدال: صام / نام / عاد / ساق / خان / غار / خاف</li><li>جمع تكسير: عروس / حلوب / قلوص / واقية / واثبة / واعدة / واعية</li><li>هات الأصل ثم جمع التكسير من: شائبة / هين</li><li>نأتي بالأصل من: استعلى / اعتدى / أبدى / استدعى / رعاة / قساة / ساسة / جيد / سيد / هين / لين</li></ul>"
                    ]
                },
                {
                    title: "المحاضرة الحادية عشرة :check:",
                    full_date: "السبت 10/12/2022 08:00 ص",
                    content: [
                        "<h4>قاعدة النسب</h4><p>زيادة يائين (أو ياء واحدة عليها شدة عند الكتابة).</p><p>* فتى ← فتايّ</p><ul><li>مشكلة التقاء ساكنين</li><li>ستتشابه مع المضاف إليّ (فتاي)</li><li>الانتقال من (ألف) إلى (ياء) بها صعوبة</li></ul>↩ تقلب (الألف) إلى (واو) ← فتويّ.<ul><li>تخلصنا من الالتباس ✓</li><li>تخلصنا من التقاء ساكنين ✓</li></ul><br><p>* الإشمام: هو أن تشم الصوت صوتاً آخر (نصفه صوت ونصفه صوتاً آخر مثل: مجرىٰها).</p><br><p>* مفتاح ← (جمع تكسير) ← مفاتِاح (مفاعيل) ← (تقلب الألف إلى ياء بسبب كثرة التاء) ← مَفاتِيح.</p><br><h4>قاعدة التصغير</h4><p>ضم الأول، و فتح الثاني و إضافة ياء التصغير الساكنة.<br>↩ مفتاح ← مُفاتيح ← مُفيتيح (لصعوبة النطق؛ قلب الألف إلى ياء، ومناسبة للتاء تكسر).</p><p>* كتاب ← كُتَيْاْب *التقاء ساكنين*<br>↩ (تقلب الألف إلى ياء) ← كُتييب ← كُتيّب (تضغم اليائين لأن الأولى ساكنة).</p><br><p>* غير العاقل إذا جمع أُنِث.</p><p>* مستشفى ← مستشفاْاْت *التقاء ساكنين*<br>↩ مستشفيات *قلب الألف إلى ياء* (تغيير وليس حذف).<br>↩ وكذلك في التثنية ← مستشفيان.</p><br><h4>المصدر</h4><p>* كسا (فعل) ← كساء (فعال).</p><p>* رجا (فعل) ← رجاء (فعال).</p><p>* سما (فعل) ← سماء (فعال).</p><p>* اصطفى (افتعل) ← اصطفاو (افتعال) ← اصطفاء.</p><p>* أبدى (أفعل) *من يبدو* ← إبداء (إفعال).</p>",
                        "<h4>تكليف</h4><ul><li>نأتي بجمع التكسير من: مصباح / محراث / ميزان / مقدار / مهماز (البطيء من الناس أو من يحتاج أن يهمزه) / مسمار</li><li>نأتي بالتصغير من: غلام / غزال / حمار / شعار / غراب</li><li>نأتي بالمثنى من: ذكرى</li></ul>"
                    ]
                },
                {
                    title: "المحاضرة العاشرة :check:",
                    full_date: "السبت 03/12/2022 08:00 ص",
                    content: [
                        "<h4>تكليف</h4><ul><li>هات المضارع ثم الجزم: صام / قال / صان / زار / طاف / رام / راح / جاد</li><li>هات اسم المفعول من: شاد / صاد / كاد / غاظ / زاد / دان / مال</li></ul>"
                    ]
                },
                {
                    title: "المحاضرة التاسعة :check:",
                    full_date: "السبت 26/11/2022 08:00 ص",
                    content: [
                        '<p>* الخط العثماني يختلف عما يُكتب به في هذا العصر في بعض المصطلحات.</p><p>* آمن ← (هي في الأصل) ← أَاْمَن</p><p>* سالَت هُذَيلٌ رَسولَ اللَهِ فاحِشَةً ← في هذا البيت الكلمة أصلها (سألت)، ولكن من باب التسهيل (سالت).</p><p>* عثمان، عفان ← يمنع من الصرف لأنها تكاد تكون أعجمية بسبب اللاحقة "ان" التي ادخلت من اللغة الفارسية.</p><p>* عربي، رومي ← (جمع بالحذف) ← عرب، روم.</p><p>* كلمة (فُلك) ← مفردها هو نفس جمعها.</p><p>* أسد ← (جمع بالإضافة) ← أسود<br>↩ وقد تجمع أُسُد.</p><p>* آتى ← (المصدر) ← ايتاء.</p><p>* آلف ← إئتلاف.</p><p>* حسناء ← (يمكن أن نقول) ← حسنى (ممدود يمكن أن نيسره) (قصر الممدود)<br>↩ تثنية ← حسناءان ← حسناوان (تقلب الهمزة).</p><p>* لا يجتمع تعريفان أو تأنيثان مثل: <del>الرجل العلم</del> (خطأ).</p><p>* صحراء ← (جمع مؤنث سالم) ← صحراءات ← صحراوات.</p><p>* خضراء ← (نسب) ← خضراءيّ أو خضراويّ.</p><p>* الكتابة اصطلاح، أي ما اتفق عليه الناس، لا شأن له بالقاعدة.</p><p>* رسالة ← رساالة ← رساال ← رسائل.</p><p>* قلادة ← قلاادة ← قلااد ← قلائد.</p><p>* ضَارَب ← (مبني للمجهول) ← ضُورِب (في الأصل ضُارِب)<br>↩ ولكن قلب (الألف) إلى (واو).</p><p>* آكل ← أُوكِل (فك الألف وقلب الثاني واو).</p><p>* شاعر ← (تصغير) ← شُايعر ← شويعر (قلب الألف).</p><p>* شاعرة ← شااعرة ← شااعر ← شواعر.</p><p>* جمع التكسير نقيض التصغير / (حمل النقيض على النقيض).</p>',
                        "<h4>كُتب تم ذكرها</h4><ul><li>كتاب الإمالة.</li><li>قطر الندى (ورقتين للأطفال) ← لابن هشام.</li><li>كتاب علم الأصوات ← د/ كمال بشر.</li></ul>",
                        "<h4>تكليف</h4><ul><li>نأتي بالمصدر من: آجال / آتى / آلف / آذن / آذى</li><li>نأتي بالمبني للمجهول من: شارك / قاتل / عارض / حاكم / آكل / ناقش / شاعر</li><li>نأتي بالتصغير من: صانع / خادم / عامل / حامد / شاعر</li><li>نأتي بالجمع من: عطية / هدية / مطية / خطيئة</li></ul>"
                    ]
                },
                {
                    title: "المحاضرة الثامنة :help:",
                    full_date: "السبت 19/11/2022 08:00 ص"
                },
                {
                    title: "المحاضرة السابعة :check:",
                    full_date: "السبت 12/11/2022 08:00 ص",
                    content: [
                        "<h4>المبني للمجهول</h4><ul><li>الماضي: يُضم الأول ويكسر ما قبل الآخر.</li><li>المضارع: يُضم الأول ويفتح ما قبل الآخر.</li></ul><p>* خرق الثوبُ المسمارَ<br>↩ هذا منافي للمنطق، كيف يخرق الثوب المسمار؟!<br>* يجوز كسر القاعدة في حالتين:<br>↩ 1- الكلام العام (المفهوم والمنطقي).<br>↩ 2- إذا كانت القاعدة لا تلبي ما أريد (لأن المعني هو الأصل).</p><br><p>* الفعل المعتل ← قال ← ق و ل ← قُوِل (مبني للمجهول حسب القاعدة)<br>↩ ولكن للتخفيف ← قُيل ← قِيِل.<br>↩ ويمكن أيضاً قِوِل.</p><p>* وعلى هذا: صام ← صِيم</p><br><p>شروط الفصاحة:<br>1- عدم تقارب المخارج.<br>2- شخص يدين لفظه معناه.</p><br><p>* الفعل الرباعي: أعاد ← أُعِيد (ضم + كسر).<br>↩ الخطوات: أُعْوِد ← أُعِيد (قلبت ياء بسبب ضعف الواو).</p><p>* أقتاد ← أُقتوِد ← أُقْتَيد ← أُقْتيْد.</p><p>* أنار ← أُنْوِر ← أُنِوْر ← أُنِير. (إعلال بالنقل أولاً ثم قلب الياء).</p>"
                    ]
                },
                {
                    title: "المحاضرة السادسة :help:",
                    full_date: "السبت 05/11/2022 08:00 ص"
                },
                {
                    title: "المحاضرة الخامسة :check:",
                    full_date: "السبت 29/10/2022 08:00 ص",
                    content: [
                        "<h4>الإبدال</h4><p>* يُحذف الحرف الأصلي من الكلمة إذا ضَعُف (إذا سُكن - إذا كان حرف علة).</p><p>* يوجد تغيير لفظي مثل حرف (ت) ← (تبدل إلي) ← (ط)، مثل: ضرب (افتعل) ← اضترب ← (إبدال) ← اضطرب.</p><p>* صيغ أخرى ← افتعل، يفتعل، مفتعل، افتعال.</p><p>* يَسَر (فعل) ← ايْتَسَر (افتعل) ← (قلب) ← اتْتَسَر ← (إدغام) ← اتَّسر.</p><br><p>*السؤال في الإمتحان* : أجب بالخطوات كاملة وبالتشكيل.</p><p>* دعا ← ادْتَعى ← ادْدَعى ← ادَّعى ← ادَّعا (لأن قبل الحرف الأخير فتحة وليس كسرة).</p><p>* يصعب الإبتداء بساكن، فوضع ألف الوصل ← توصلاً لنطق الحرف الساكن (افْتَعَل).</p><p>* الحرف الأخير لا داعي لتشكيله.</p><p>* وَصَف (فعل) ← اوْتَصَف (افتعل) ← (إبدال) ← اتْتَصف ← اتَّصف (تضغم التاء).</p><p>* إذا كان (الألف) حرف رابع أو خامس يقلب (ألفاً لينة) مثل: (ادّعا) من ادّعى.</p><p>* ذَكَر (فعل) ← اذْتَكر (افتعل) ← اددكر (تقلب الذال والتاء إلى دال بسبب الثقل) ← ادّكر (يضغم الحرفان).</p><p>↩ ومن ذلك أيضاً: مُفْتعل ← مُدّكِر من (مُذْتَكر).</p><p>* وَهَم (فعل) ← اوْتَهم (افتعل) ← (قلب الواو) ← اتْتَهم ← (تضغم التاء) ← اتَّهم<br>↩ من الإتهام؟ صحيح.</p><p>* زَان (فعل) ← ازْتين (افتعل) ← ازدان (تقلب التاء دالاً).</p>* (افتعل) تقلب التاء دالاً إذا وقعت بعد: ( د / ذ / ز )<p>* الإبدال 4 قواعد.</p><p>* الفعل الصحيح الثلاثي يأتي على صورة (حركة سكون حركة) ← قاعدة تُبنى على الكثير.</p>",
                        "<h4>الإعلال</h4><p>- الفعل الأجوف الثلاثي:<br>* قال ← أصلها قَوَل ← (المضارع) ← يَقْوُل (يفْعل) *نلاحظ الثقل*</p><p>↩ الحل ← إعلال بالنقل (أو بالتسكين) ← (نبدل الحركة مكان السكون) ← يَقُوْل.</p><p>* عاج / ساج ← غير معروف هل أصل الألف (واو) أم (ياء). </p><p>* صام (فعل) ← يَصْوُم (يفْعل) ← (إعلال بالنقل) ← يَصُوْم.</p><p>* طاف ← يَطْوُف ← يَطُوْف.</p><p>* سار (حركة سكون حركة) ← يَسْيِر (تنقل حركة الياء -الكسرة- إلى الساكن الصحيح قبلها -السين- وذلك لاستثقال الكسر والياء في النطق) ← فتصبح هكذا: يَسِيْر.</p><p>* أخاف (أفعل) ← (أصلها) ← خَوَف (واو) ← يُخْوف (يُفْعِل)<br>↩ 1- يُخوْف (إعلال بالنقل)<br>↩ 2- (الواو بضعفها تتأثر بالفاء، فتتحول إلى ياء) يُخيف (إعلال بالقلب).</p><p>* أضاف ← يُضْيف ← يُضيْف (إعلال بالنقل).</p><p>* أمات ← (أصلها) ← يموت (واو) ← يُمْوِت (يُفْعل)<br>↩ 1- يُموْت (إعلال بالنقل)<br>↩ 2- يُمِيت (تأثراً بالكسرة تقلب ياء) (إعلال بالقلب).</p>",
                        "<h4>تكليف على الإعلال و الإبدال</h4><p>*مطلوب تحليل الكلمات في ورقة خارجية ويتم تسليمها المحاضرة القادمة.</p><ul><li>الحل يكون على وزن مثل (افتعل) و (يفعل).</li><li>كلمات الإبدال: وعد / وصل / وعظ / وسم / وسخ / وضح / وقى / يئس / زجر / درأ / زها / زحم / طرد / طوع / صفا / صرع.</li><li>كلمات الإعلال: عاد / قام / صام / جاد / ساد.</li></ul>"
                    ]
                },
                {
                    title: "المحاضرة الرابعة :help:",
                    full_date: "السبت 22/10/2022 08:00 ص"
                },
                {
                    title: "المحاضرة الثالثة :help:",
                    full_date: "السبت 15/10/2022 08:00 ص"
                },
                {
                    title: "المحاضرة الثانية :help:",
                    full_date: "السبت 08/10/2022 08:00 ص"
                },
                {
                    title: "المحاضرة الأولى :check:",
                    full_date: "السبت 01/10/2022 08:00 ص",
                    content: [
                        "<ul><li><h4>الواجب</h4></li><li><h4>الممتنع</h4></li><li><h4>الإمكان</h4></li></ul>"
                    ]
                }
            ],
            last_update: {
                time: "08:01 م",
                date: "28/02/2023"
            }
        },
        modern_literature_poetry: {
            name: "الأدب الحديث ونصوصه (شعر) شعر التطورات الجديدة",
            professors: [
                "أ.د عبدالله عبدالحليم"
            ],
            documents: [
                {
                    title: "المقرر الإلكتروني",
                    type: "pdf",
                    path: "docs/مقرر%20الأدب%20الحديث%20ونصوصه%20(شعر)%20-%20الشعر%20الحر%20وقصيدة%20النثر.pdf"
                }
            ],
            events: [
                {
                    title: "المحاضرة الثانية :check:",
                    full_date: "السبت 18/02/2023 12:00 م",
                    content: [
                        '<p>التطورات الجديدة: المداخل والنظريات الجديدة على الشعر العربي الحديث وتمثلت في محورين:</p><h4>- المحور الأول (الشعر الحر)</h4><p>↩ هو ذلك الشعر الذي بدأ على يد <a href="https://ar.wikipedia.org/wiki/%D9%86%D8%A7%D8%B2%D9%83_%D8%A7%D9%84%D9%85%D9%84%D8%A7%D8%A6%D9%83%D8%A9" target="_blank">نازك الملائكة</a> الشاعرة العراقية عام 1948م، وكان هناك وباء في الوطن العربي الكوليرا؛ فكتبت قصيدة تحت هذا العنوان ضاربة بالعروض العربي والوزن الخليلي عرض الحائط.</p><p>* أهم أعلام مدرسة الشعر الحر:<p><ul><li>نازك الملائكة</li><li><a href="https://ar.wikipedia.org/wiki/%D8%B9%D8%A8%D8%AF_%D8%A7%D9%84%D9%88%D9%87%D8%A7%D8%A8_%D8%A7%D9%84%D8%A8%D9%8A%D8%A7%D8%AA%D9%8A" target="_blank">عبد الوهاب البياتي</a></li><li><a href="https://ar.wikipedia.org/wiki/%D8%A8%D8%AF%D8%B1_%D8%B4%D8%A7%D9%83%D8%B1_%D8%A7%D9%84%D8%B3%D9%8A%D8%A7%D8%A8" target="_blank">بدر شاكر السياب</a></li><li><a href="https://ar.wikipedia.org/wiki/%D9%85%D8%AD%D9%85%D9%88%D8%AF_%D8%AF%D8%B1%D9%88%D9%8A%D8%B4" target="_blank">محمود درويش</a></li><li><a href="https://ar.wikipedia.org/wiki/%D8%B5%D9%84%D8%A7%D8%AD_%D8%B9%D8%A8%D8%AF_%D8%A7%D9%84%D8%B5%D8%A8%D9%88%D8%B1" target="_blank">صلاح عبد الصبور</a></li><li><a href="https://ar.wikipedia.org/wiki/%D8%A3%D8%AD%D9%85%D8%AF_%D8%B9%D8%A8%D8%AF_%D8%A7%D9%84%D9%85%D8%B9%D8%B7%D9%8A_%D8%AD%D8%AC%D8%A7%D8%B2%D9%8A" target="_blank">أحمد عبد المعطي حجازي</a></li><li><a href="https://ar.wikipedia.org/wiki/%D9%86%D8%B2%D8%A7%D8%B1_%D9%82%D8%A8%D8%A7%D9%86%D9%8A" target="_blank">نزار قباني</a></li></ul><p>* شعراء الشعر الحر مارسوا الكتابة على البحور الشعرية.</p><p>* يقول الطاهر المكي في كتابه (الشعر العربي المعاصر - روائعه ومدخل لقراءته): "إن اﻟﺠﺎﻧﺐ اﻷﻋﻈﻢ ﻣﻦ اﻟﺸﻌﺮ اﻟﺤﺮ بقي في منتصف الطريق بين الشاعر والجمهور، يعلوه غبار النسيان في اللحظة التي ولد فيها"</p><h4>- المحور الثاني (قصيدة النثر)</h4>'
                    ]
                },
                {
                    title: "المحاضرة الأولى :cross:",
                    full_date: "السبت 11/02/2023 11:00 ص"
                }
            ],
            last_update: {
                time: "10:18 م",
                date: "15/03/2023"
            }
        },
        modern_literature_prose: {
            name: "الأدب الحديث ونصوصه (نثر)",
            professors: [
                "أ.د عزت جاد",
                "أ.د سيد علي"
            ],
            documents: [
                {
                    title: "المقرر الإلكتروني (أ.د عزت جاد)",
                    type: "pdf",
                    path: "docs/مقرر%20الأدب%20الحديث%20ونصوصه%20(نثر)%20-%20نقد%20النثر%20المعاصر.pdf"
                },
                {
                    title: "المقرر الإلكتروني (أ.د سيد علي)",
                    type: "pdf",
                    path: "docs/مقرر%20الأدب%20الحديث%20ونصوصه%20(نثر)%20-%20جمعية%20أنصار%20التمثيل.pdf"
                },
                {
                    title: "فن المقال - أ.د عزت جاد",
                    type: "pdf",
                    path: "docs/فن%20المقال%20-%20أ.د%20عزت%20جاد.pdf"
                }
            ],
            notes: [
                'رابط مجموعة فيسبوك خاصة بمحاضرات أ.د عزت جاد. <a href="https://www.facebook.com/groups/444382037025786/" target="_blank">اضغط هنا</a>',
                'أ.د سيد علي<br><br><a href="https://www.facebook.com/sayed.ali.984" target="_blank">الصفحة الشخصية على فيسبوك</a><br><br><a href="https://www.youtube.com/channel/UCBZFxNophEcdvj7nafu0_gQ" target="_blank">رابط قناة يوتيوب</a>',
                'تعليمات خاصة بـ أ.د سيد علي: <ul><li>لا يسمح بالتأخير لأكثر من 10 دقائق.</li><li>أهمية حضور كل المحاضرات قبل شهر رمضان.</li><li>عدم ذكر اسم أي دكتور آخر.</li><li>عند طباعة الكتاب المقرر، يجب الإحتفظ باسم الدكتور وذلك لحقوق الملكية.</li></ul>'
            ],
            events: [
                {
                    title: "المحاضرة الثانية (أ.د سيد علي) :check:",
                    full_date: "الأربعاء 15/02/2023 04:00 م",
                    content: [
                        '<p>المحاضرة القادمة عليها جزء من أعمال السنة وستشرحها د. هند. (لذا يجب على الجيمع الحضور).</p>'
                    ]
                },
                {
                    title: "المحاضرة الأولى (أ.د عزت جاد) :check:",
                    full_date: "الأربعاء 15/02/2023 10:00 ص",
                    content: [
                        '<h4>المنهج</h4><ul><li>مقال</li><li>رواية</li><li>قصة قصيرة</li></ul><br><p>* النثر الأدبي: ليس الكلام العادي ، وإنما رصد الجماليات ووضعها على سلم الروعة.</p><p>* لدينا (لغة تواصلية - ولغة جمالية).</p><p>* المقال من ضمن النثر الأدبي، وهو (خمسة أنواع)... وأهمهم المقال الأدبي.</p><p>* أصول الكتابة الإبداعية (مثل تجنب كتابة الأعداد حسابياً).</p><p>* أركان المقال: مقدمة - جسد body - خاتمة conclusion.</p><br><p>* حشو المقال ← روح المقال. تغنى بأشياء أدبية.</p><ul><li>التعبير بالصورة (الكنية) لتقريب الأشياء، لا بالأشياء نفسها (المعنى الصريح يفقد النص أدبيته).</li><li>التعبيرات في المقال مجازية، بشرط وفق السياق الواقع فيه.</li></ul><p>* <a href="https://www.hindawi.org/books/61379142/5/" target="_blank">مقال عرش الورد</a> للرافعي.</p>',
                        '<p>مطلوب عمل مقال، سيتم اختيار 2 من ضمن 10 مواضيع، وسيأتي في الإمتحان سؤال إجباري عن المقال يحتوي على موضوعين نختار منهم واحداً.</p><br><p>* تم اختيار بناء على تصويت:</p><ul><li>أجمل ما في حياتي (ممكن تتكلم فيه عن الأب أو الأم أو هوية أو صديق وهكذا... ليس شيئاً محدداً)</li><li>الصديق زاد العمر ومرآة الذات</li></ul>'
                    ]
                }
            ],
            last_update: {
                time: "10:18 م",
                date: "15/03/2023"
            }
        },
        comparative_literature: {
            name: "الأدب المقارن (عربي - شرقي)",
            professors: [
                "أ.د رشا صالح"
            ],
            documents: [
                {
                    title: "التأثير الفارسي في الرسائل العربية (عبدالحميد الكاتب)",
                    type: "pdf",
                    path: "docs/التأثير%20الفارسي%20في%20الرسائل%20العربية%20(عبدالحميد%20الكاتب).pdf"
                }
            ],
            events: [
                {
                    title: "المحاضرة الثانية :check:",
                    full_date: "الأربعاء 15/02/2023 12:00 م",
                    content: [
                        '<h4>الطابع الإسلامي واضح في الرسالة</h4><p>في المقدمة يؤكد الكاتب المقام الديني للخليفة الذي كُتبت الرسالة باسمه والمركز الديني لولي عهده الذي وجهت الرسالة إليه، وكلك الطابع الديني للمهمة التي وكلت إلى ولي العهد، وذلك بقول الكاتب إن هذه النصيحة من أمير المؤمنين ولا يقصد بها تلافي عيوب وجدت في ولي العهد وإنما هي نصيحة من أب لإبنه.</p><p>بالإضافة إلى أداء الفرائض، ينصح ولي العهد أن يقوم بقراءة القرآن يومياً وتدبره.</p><p>* ومما يؤكد الطابع الإسلامي كثرة الإقتباسات من القرآن الكريم واستخدام التعبيرات القرآنية ثم تكرار الدعوات للأمير بالنصر والسلامة والهدى وبعث الأمل بالجزاء الحسن في الآخرة، لا فقط حسن العمل وحسب.</p><p>* الجزء الخاص بأخلاق الطبقة الحاكمة مستمد من الثقافة الفارسية، والتي ظهرت في أواخر القرن الأول من الهجرة وكانت خاصة بصفات ملوك الفرس.</p><p>* أما روح الرسالة فتمتاز بالروح العربية وبالطابع الإسلامي الديني... أخلاقيات الحكام فقط هي المستمدة من الثقافة الفارسية لأن الإسلام أصلا ساوى بين أخلاق الحكام والمحكومين.</p><br><p>* القسم الأول من الرسالة يعكس مجموعة من قواعد السلوك وهي مستمدة من الثقافة الفارسية (حركاته - إشاراته - مشيته - جلوسه - طريقة أكله وشربه).</p><p>* إصرار عبدالحميد على التنوية بهذه السلوكيات في حالة العرب العصيبة يوضح أهميتها وترسيخها.</p><p>* تجد نظرية الوسط (الوسطية) في رسالته التي قال بها أرسطو وهي تقول أن الفضيلة توجد وسطاً بين رذيلتين.</p><p>↩ وهذه النظرية وجدت طريقها إلى الثقافة الفارسية قبل الإسلام، ومن هنا كانت الفارسية القناة الأولى لتسريب الأفكار الإغريقية إلى الثقافة العربية.</p><p>↩ *لنشير إليها فقط* تسمى نظرية الوسط أو القصد الآرسطية وتجعل نظرية القصد مبدأً فلسفياً عاماً وهو ما أرساه الإسلام عملياً.</p><p>↩ *انتقال نظرية القصد* إغريق ← فرس ← ثقافة إسلامية.</p><p>* مما يؤكد أن عبدالحميد استقى هذه النظرية من الفارسية وليس من القرآن أو الثقافة الإسلامية، لأن عبدالحميد يدعو للقصد بشكل عام في الطمع والجشع والشجاعة وهكذا، أما القرآن لم يشر إلى القصد في كل ذلك بشكل عام وإنما خصص الإشارة.</p><br><p>* قادة الجيش أبناء بيوتات *اشتراط نُبل المولد* (من الأفكار الفارسية التي ضمنها عبدالحميد رسالته) ووجوب توفر هذه الصفة فيهم، وهذه الكلمة لم تكن موجودة من قبل ولم تظهر في أي نص عربي قبل 2هـ، وإنما ظهرت عند عبدالحميد أول مرة.</p><p>* ومما يؤيد أن عبدالحميد استقى هذه النظرية من الفارسية أن المجتمع الفارسي كان طبقياً؛ فمن المحال أن يكون استقاها من الثقافة العربية.</p><p>* يقول "طه حسين" أن التأثير الذي وقع في كتابته الرسالة كان يونانياً -أي أن مصدره اللغة الإغريقية- مثل (إسرافه في الحال) وأنه لم يتأثر بالثقافة الفارسية، ويقول أيضاً أن تقسيم وحدات الجيش إلى مئات موجود في الجيش البيزنطي</p><p>↩ وهذه حجج واهية مردود عليها.</p><br><p>* الرسالة لم يكن فيها حسن تقسيم بل امتازت بالتكرار، فكيف يكون عبدالحميد متأثراً بالإغريق؟</p><p>* أما (الإسراف في الحال) فما الرد عليه؟</p><p>↩ أن عبدالحميد كان عليماً باللغة الإغريقية (تقريباً)... ونقول أن كل هذا الذي ذكره طه حسين موجوداً بطبيعة الحال في الثقافة الفارسية.</p>'
                    ]
                },
                {
                    title: "المحاضرة الأولى :check:",
                    full_date: "الأربعاء 15/02/2023 08:00 ص",
                    content: [
                        '<h3>التأثير الفارسي في الرسائل اللغوية (عبدالحميد الكاتب)</h3><p>تُعد الرسالة أكثر تعبيراً عن الحياة العربية الإسلامية من فروع الأدب الأخرى.</p><ul><li>التأثير الفارسي يعتبر أبلغ في إثبات قوة التأثير الفارسي على النثر العربي من ذلك التأثير على الجوانب الأخرى للأدب.</li><li>مادة الرسالة كانت تُستمد أساساً من التراث العربي الإسلامي؛ ولهذا تجد النزعة الإسلامية في الرسائل أوضح منها في الجوانب الأخرى من الأدب.</li><li>تاريخ الرسائل قبل 2هـ في حاجة إلى كتابة جديدة تأخذ في الحسبان ذلك التعبير الذي طرأ على تطور الرسائل تحت تأثير الثقافة الفارسية.</li><li>كل النصوص الأدبية السابقة على 2هـ مجال تشكيك في صحتها أو نسبتها.</li><li>استمد "طه حسين" فكرة تشككه في الشعر الجاهلي من المستشرق <a href="https://ar.wikipedia.org/wiki/%D8%A5%D8%B1%D9%86%D8%B3%D8%AA_%D8%B1%D9%8A%D9%86%D8%A7%D9%86" target="_blank">رينان</a>.</li></ul>وفكرة الشك في النثر الجاهلي ونثر القرن الأول عند <a href="https://ar.wikipedia.org/wiki/%D9%88%D9%84%D9%8A%D9%85_%D9%85%D8%B1%D8%B3%D9%8A%D9%87" target="_blank">وليام مرسيه</a> الذي يرى أن النصوص النثرية أنها وصلت القرن الثاني في أكثرها عن طريق "الرواية الشفوية".<p>غير أن وجود أجناس أدبية نثرية في الفترة السابقة على ق2هـ مثل: (الحديث - الرسالة - الوصية - الخبر).</p><p>* من أهم خصائص رسائل القرن الأول من خلال دراسة فارسية هي أن الرسالة تُعد مخاطبة مكتوبة تتكون من سلسلة التأملات الخلقية أو المواعظ الدينية أو الأقوال الحكمية، يضيف إلى أن الرسالة كانت تتميز بـ (القصر - الميل إلى معالجة القضايا العملية)</p><p>↩ يتضح من ذلك أن الغاية (الخلقية أو الدينية) كانت من السمات البارزة للرسالة.</p><p>* يرتبط هذا التطور باسم (عبدالحميد بن يحي الكاتب) الذي كان صديقاً لـ(ابن المقفع).</p><p>* بالرغم من المظهر العربي الذي كان يبدو على نسبه، فإن أكثر المراجع تؤكد على أنه فارسي الأصل، وأن صلته بقبيلة (بنو عامر بن لؤي) هي صلة نسب.</p><br><h3>س/ يرجع الفضل إلى عبدالحميد الكاتب في إرساء التقاليد الجديدة، وضح ذلك</h3><p>- أنه أطال الرسائل.</p><p>- نوع في البدايات والخواتيم حسب تنوع موضوعاتها.</p><p>- كتب رسائل في موضوعات جديدة مُستمدة من التراث الإسلامي.</p><p>- التحدث عن التوجهات الخلقية.</p><p>- يَمس المبادئ العامة لا الخاصة كما عمل كتاب الرسائل من قبل.</p><p>- اعتمد على كتابة الرسائل الفارسية</p><p>↩ وقد عبر أبوهلال العسكري عن ذلك في "ديوان المعاني": "أم أن العجم والعرب في البلاغة سواء، فمن تعلم البلاغة بلغة من اللغات ثم انتقل إلى أخرى أمكنه من صنعة الكلام ما أمكنه من الأولى"</p><br><p>* الكتابة النثرية اللغوية (البهلوية) تشبه في موضوعاتها الرسائل العربية التي كتبها عبدالحميد الكاتب.</p><p>- أخلاق الطبقة الحاكمة: لا يوجد اختلاف يذكر ولكن على الحاكم أن يتحلى بالأخلاق الكريمة.</p><p>* ومن الرسائل التي وصلتنا من عبدالحميد الكاتب وتتكلم عن نصائح الطبقة الحاكمة على لسان "مروان بن محمد" إلى ولي عهد الخلافة "عبدالله بن مروان" لتوليته حملة ضد الخوارج في العراق عام 129هـ.</p>'
                    ]
                }
            ],
            last_update: {
                time: "03:40 ص",
                date: "17/02/2023"
            }
        },
        popular_literature: {
            name: "الأدب الشعبي",
            professors: [
                "أ.د صلاح السروي"
            ],
            notes: [
                "بيت شعري قاله صديق لدكتور صلاح يُعدُّ بمثابة حكمة في الحياة: والعش دا لو يوم ينهجر *** يبدأ نزوله من الشجر... قشاية قشاية.",
                "الكتاب موجود في مكتبة الفتح"
            ],
            events: [
                {
                    title: "المحاضرة الثانية :check:",
                    full_date: "الخميس 16/02/2023 01:00 م",
                    content: [
                        "<p>جزء أساسي من تعريف الأدب الشعبي أنه قديم، ولكن دراسات الأدب الشعبي حديثة (أي مع القرن 19).</p><p>* الآلة البخارية (ثقافة العلم) (تحول الطبقة البرجوازية إلى طبقة رأس مالية).</p><p>* الوسيط (أو الوسيلة) ليس محايداً.</p><p>* إعادة إكتشاف قضايا وعلوم (مثل علم التاريخ، علم النفس، دراسات الأدب الشعبي، ...)</p><p>* نعتبر الفارق بين القرن التاسع عشر وما قبله هو فارق كيفي (من نواتج الحداثة).</p><p>* أهمية المنهج العلمي المضبوط وإلا تكون مجرد تأملات أو دردشات.</p><p>* الريف أكثر ارتكازية وتقاليد من المدن التي تقوم على الفردية والحرية الشخصية.</p><p>↩ نلخص ذلك في أنه ظهر العلم وبخاصة (العلوم الإنسانية).</p><br><h4>* لماذا في تلك المرحلة تم الإلتفات إلى دراسات الأدب الشعبي / لماذا هي جديدة؟</h4><p>↩ لأن التطور نحو الدولة المدنية الديموقراطية الحديثة الناتج عن كل تلك الفعاليات السابق ذكرها نتج فكرة (الدولة الأمة).</p><p>↩ نظراً للولادة القومية للدولة الحديثة كان لابد من النظر بعين الإهتمام إلى الأدب القومي والثقافة القومية التي هي جذور الثقافة الشعبية وعلى هذا الأساس الإهتمام بدراسة الادب الشعبي (دافع سياسي).</p><br><p>* دولة تعني: أرض/ شعب / إدارة.</p><p>↩ في الإمبراطوريات القديمة كانت الأرض ليست أرض شخصاً بعينه بل كانت للملك.</p><p>* التجارة هي الإنتقال من مكان إلى مكان.</p><p>* نادوا بوحدة السوق بعد التقدم الصناعي -mass production- على أساس الأمة والقومية (حصل حركة توحيد بعد الإمارات).</p><p>* القومية تساوي العرق... بينما الوطنية مرتبطة بالأرض أو المكان.</p><p>* كتاب *أدب الفلاحين* لشوقي عبدالحكيم (الفلاحة جزء أساسي من النشاط الإنتاجي الثقافي لشعب مصر).</p><p>* الأدب الشعبي أقدم أنواع الأدب، وقد ولد مع ولادة الإنسان (عملية التجريب) ونتج عنه (التجريد أي التعميم).</p><p>* كتاب *ضرورة الفن* لإرنست فيشر (يقول أن الفن ناتج عن العمل) (التجريب والممارسة ينتج عنه تجريد).</p><p>* جورج لوكاتش: الفن هو حصيلة سعي الإنسان نحو المعرفة (الفن كلي، تعليمي، تجريدي).</p><p>* العصر العبودي: البطل العملاق، العصر الإقطاعي: الأخلاقي (الكوميديا الإلهية) و (دون كيشوت)، العصر البرجوازي: البطل الحديث (أكون أو لا أكون) (البطل مُخير).</p><br><p>* الأدب الشعبي، اتجاهات:</p><ul><li>اللهجة الدارجة، الأساس فيه اللهجة الدارجة التي جاءت عن طريق المشافهة</li><li>اللهجة الدارجة فقط (بالإطلاق) من القدم</li><li>كل ما جاء سواء من اللهجة الدارجة او غير الدارجة</li></ul><p>↩ أهمهم وأرجحهم الإتجاه الأول.</p><p>* فلكلور -Folklore -: حكمة الشعب أو التراث الشعبي (وهو أعم من الأدب الشعبي).</p><p>* الأدب الشعبي هو الذي أنتجته وأستهلكته الجماعة الشعبية وهو واسع الإنتشار.</p>"
                    ]
                },
                {
                    title: "المحاضرة الأولى :check:",
                    full_date: "الأربعاء 15/02/2023 02:00 م",
                    content: [
                        '<h3>ما الشعبية؟</h3><p>* تعريف الأدب: تشكيل جمالي مادته اللغة.</p><p>* معنى الأدب الشعبي: (أدب العوام) مرتبط بمفهوم pick & eat -الملكية الخاصة- وقد ظهرالمجتمع الطبقي على مفهوم العبودية ومن ذلك ظهر لدينا:</p><ul><li>أدب رسمي<br>(طبقة خاصة)</li><li>أدب شعبي<br>(طبقة مسروقة وعامة - عين الإحتقار وعدم الإحترام - أخلاق السوقة - الدهماء - العلوج)</li></ul><p>* صراع الطبقات والشعوب مع بعضها (كل طبقة ترى الغير هم *بربر*) ويعتبرون أنفسهم العالم على عكس الآخرين.</p><p>*بربر: كان اليونان يطلقونها على غير اليوناني (همجي).</p><p>* المرحلة الطوطمية Totemism</p><p>↩ نجد خصوصية الحضارات (بسبب ظروف المواصلات) - وسائل بدائية.</p><p>↩ تم الحقر من شأن الآخرين قبل فكرة العالمية، والحداثة وتطور الآلات الميكانيكية والتواصل.</p><p>* قبل ذلك كان الأدب كله شعبياً، فقد كان قديماً كل شيء هو لغز (الأمطار لغز - الزلازل - ...)، ويسمي ذلك بـ <a href="https://ar.wikipedia.org/wiki/%D8%A3%D8%B1%D9%88%D8%A7%D8%AD%D9%8A%D8%A9" target="_blank">Animism</a> أو الروحية</p><p>↩ ومعناها تخيل وجود روح في كل ظاهرة. وتطورت بعد ذلك وأصبحت آلهة (الدين البدائي) وإنتاج الأساطير.</p><br><p>* أي أدب يقوم على:<br>1- تحقيق المتعة الجمالية.<br>2- تحقيق المعرفة.</p><br><p>↩ والأسطورة أول أشكال الأدب الشعبي: من سطر / يسطر (القداسة) - كما نجد أيضاً فكرة *البطل الخارق* كذلك.</p><h3>الشعبية، من انتشاره -popularity- ؟</h3><p>↩ لا، بل من انتاجه من قبل الطبقة الشعبية. (كما أن المستويات في الشعبية متباينة).</p><br><p>* إذاً الشعبية هي الجماعة الشعبية من انتجته وقد وجدته عبر تاريخها، كما أتاحت الشفاهية إمكانية الإضافة أو الحذف بحسب تداول العصور، مما جعل هذا الأدب ينتمي إلى الجماعة الشعبية.</p><p>* يختلف الجمهور من زمن إلى آخر ومكان إلى آخر فيتم الحذف والإضافة، والجماعة الشعبية هي التي اصطفت هذه الأعمال.</p><p>↩ مثل الإلياذة والأوديسة (فقط) في اليونان.</p><p>↩ مثل مهابهاراتا في الهند (فقط).</p><p>↩ مثل أبوزيد، عنترة، وبعض أعداد محدودة (فقط) في العرب.</p><p><strong>* لماذا بقيت هذه الأعمال بالتحديد؟</strong> بسبب الإصطفاء، مما منح هذه الأعمال الصفة الشعبية.</p><br><p>* قد تتحول بعض الأعمال من رسمية إلى شعبية، كيف تحكم على الشعبية الحقيقية؟</p><p>* فكرة المشافهة والتداول ← كُتب لهذا الأدب شعبيته.</p><p>* كل رواية تحمل سمات العصر.</p><br><h3>أهمية الأدب الشعبي ودراسته؟</h3><p>↩ أولاً: يمكننا من دراسة تاريخ وأفكار والتصورات (حتى نعرف من نحن ← علينا أن نعرف من لسنا نحن)</p><p>↩ وعلى الرغم من ذلك؛ الأدب الشعبي ليس الآخر بل جوهر ذاتي الثقافية.</p><p>* <a href="https://ar.wikipedia.org/wiki/%D9%83%D8%A7%D8%B1%D9%84_%D9%8A%D9%88%D9%86%D8%BA" target="_blank">كارل يونج</a> واللاوعي الجماعي. ومثال ذلك ثورة 25 يناير، فقد كانت حالات التحرش والإعتداءات معدومة... وبعضهم أسند ذلك إلى الجينات المصرية، ولكن الأدق هو الثقافة المصرية (فلا يوجد عرق نقي 100%)</p><p>* الوعي هو حاكم اللاوعي. واللاوعي هو حقيقة المرء (حالات الإنفعال والتوتر والسُكْر والنوم)</p><p>* موطن اللاوعي الجمعي هو الثقافة الشعبية.</p><p>* لا شيء يموت فيما يتعلق بالفكر والأدب. (مثل ارسطو ونجيب محفوظ...الخ)</p><p>* إذا فنحن نفهم جوهر وحقيقة الأمة.</p><br><p>↩ ثانياً: فهم الظواهر الراهنة.</p>'
                    ]
                }
            ],
            last_update: {
                time: "07:00 م",
                date: "28/02/2023"
            }
        },
        research_methods: {
            name: "مناهج البحث الأدبي",
            professors: [
                "أ.م.د يسري عبدالله",
                "أ.م.د فاطمة قنديل"
            ],
            events: [
                {
                    title: "المحاضرة الثالثة (أ.م.د يسري عبدالله) :check:",
                    full_date: "السبت 18/02/2023 02:00 م"
                },
                {
                    title: "المحاضرة الثانية :cross:",
                    full_date: "الخميس 16/02/2023 04:00 م"
                },
                {
                    title: "المحاضرة الأولى :cross:",
                    full_date: "السبت 11/02/2023 04:00 م"
                }
            ],
            last_update: {
                time: "07:52 م",
                date: "28/02/2023"
            }
        },
        criticism: {
            name: "النقد الأدبي الحديث (المناهج المعاصرة)",
            professors: [
                "أ.د جميل عبدالمجيد"
            ],
            events: [
                {
                    title: "المحاضرة الأولى :cross:",
                    full_date: "الخميس 16/02/2023 10:00 ص"
                }
            ],
            last_update: {
                time: "03:58 م",
                date: "28/02/2023"
            }
        }
    }
};

const index_page = document.querySelector("#index");
const study_schedule = document.querySelector("#study_schedule");
const subjects_div = document.querySelector("#subjects");

const subject_page = document.querySelector("#subject");
const subject_content = document.querySelector("#subject_content");

const switchPage = (page) => {
    let html = [];
    if (index_page && study_schedule && subjects_div && subject_page && subject_content) {
        if (page in data.subjects) {
            // Show Subject data
            index_page.className = "hidden";
            subject_page.className = "";
            let subject = data["subjects"][page];
            document.title = subject.name + " - كلية الآداب قسم اللغة العربية جامعة حلوان 2022/2023";
            let last_update = subject.last_update? `<span>آخر تحديث: ${subject.last_update.date} ${subject.last_update.time} <img id="refresh" alt="أيقونة التحديث" src="img/refresh.png"></span>`: "";
            let professors = "";
            if (subject.professors && subject.professors.length) {
                for (let professor of subject.professors) {
                    professors += `<p>${professor}</p>`;
                }
            }
            html.push(`<h1>مادة ${subject.name}</h1>${professors}${last_update}`);

            if (subject.documents && subject.documents.length) {
                html.push('<div class="subject_section"><h2>المستندات الإلكترونية</h2><div id="docs">');
                for (let document of subject.documents) {
                    html.push(`<a target="_blank" href="${document.path}"><img src="img/${document.type}.png" alt="أيقونة المستند الإلكتروني"><p><strong>${document.title}</strong></p></a>`);
                }
                html.push("</div></div>");
            }

            html.push('<div class="subject_section"><h2>الملاحظات</h2>');
            if (subject.notes && subject.notes.length) {
                html.push('<div class="notes">');
                let count = 1;
                for (let note of subject.notes) {
                    html.push(`<div><h3>${count}#</h3><p>${note}</p></div>`);
                    count++;
                }
                html.push("</div>");
            } else {
                html.push("<p>لا توجد ملاحظات.</p>");
            }
            html.push("</div>");

            html.push('<div class="subject_section"><h2>الأحداث</h2>');
            if (subject.events && subject.events.length) {
                html.push('<ul class="tree">');
                for (let event of subject.events) {
                    let title = event.title;
                    title = title && title.replace(/:check:/g, '<img src="img/check.png" alt="علامة صحيح">');
                    title = title && title.replace(/:help:/g, '<img src="img/help.png" alt="علامة غير معروف">');
                    title = title && title.replace(/:cross:/g, '<img src="img/cross.png" alt="علامة خطأ">');

                    let content = "";
                    if (event.content && event.content.length) {
                        content += '<ul>';
                        for (let sub_leaf of event.content) {
                            sub_leaf = sub_leaf.replace(/\*/g, '<span class="blue">*</span>');
                            sub_leaf = sub_leaf.replace(/←/g, '<span class="blue">←</span>');
                            sub_leaf = sub_leaf.replace(/↩/g, '<span class="blue">↩</span>');
                            content += `<li class="branch"><div class="leaf">${sub_leaf}</div></li>`;
                        }
                        content += "</ul>";
                    }
                    html.push(`<li class="branch"><div class="leaf"><h3>${title}</h3><span class="event_date">${event.full_date}</span></div>${content}</li>`);
                }
                html.push("</ul>");
            } else {
                html.push("<p>لا توجد أحداث لعرضها!</p>");
            }
            html.push("</div>");

            subject_content.innerHTML = html.join("");
        } else {
            // Show Index page
            index_page.className = "";
            subject_page.className = "hidden";
            document.title = "صفحة الطالب الجامعي - كلية الآداب قسم اللغة العربية جامعة حلوان 2022/2023";
            for ( subject_name in data.subjects ) {
                let subject = data["subjects"][subject_name];
                let professors = "";
                if (subject.professors && subject.professors.length) {
                    professors += "<div>";
                    for (let professor of subject.professors) {
                        professors += `<p>${professor}</p>`;
                    }
                    professors += "</div>";
                }
                let last_update = subject.last_update? `<div class="last_update"><div><i><img src="img/refresh.png" alt="أيقونة التحديث">${subject.last_update.time}</i><i>${subject.last_update.date}</i></div></div>`: "";
                html.push(`<a href="index.html?subject=${subject_name}"><div class="subject"><div><img src="img/books.png" alt="أيقونة كُتب"><h2>${subject.name}</h2></div>${professors}${last_update}</div></a>`);
            }
            study_schedule.innerHTML = `<h2>الجدول الدراسي</h2><div id="study_schedule_container"><table><thead><tr><th></th><th>08 - 10</th><th>10 - 12</th><th>12 - 02</th><th>02 - 04</th><th>04 - 06</th></tr></thead><tbody><tr><td><h3>السبت</h3></td><td colspan="2"><div><h4>${data["subjects"]["grammer"].name}</h4><p>${data["subjects"]["grammer"].professors[0]}</p><strong>م17ج</strong></div></td><td colspan="2"><div><h4>${data["subjects"]["modern_literature_poetry"].name}</h4><p>${data["subjects"]["modern_literature_poetry"].professors[0]}</p><strong>م17ج</strong></div></td><td><div><h4>${data["subjects"]["research_methods"].name}</h4><p>${data["subjects"]["research_methods"].professors[0]}</p><strong>م17ج</strong></div></td></tr><tr><td><h3>الأربعاء</h3></td><td><div><h4>${data["subjects"]["comparative_literature"].name}</h4><p>${data["subjects"]["comparative_literature"].professors[0]}</p><strong>م18و</strong></div></td><td><div><h4>${data["subjects"]["modern_literature_prose"].name}</h4><p>${data["subjects"]["modern_literature_prose"].professors[0]}</p><strong>م18و</strong></div></td><td><div><h4>${data["subjects"]["comparative_literature"].name}</h4><p>${data["subjects"]["comparative_literature"].professors[0]}</p><strong>م18و</strong></div></td><td><div><h4>${data["subjects"]["popular_literature"].name}</h4><p>${data["subjects"]["popular_literature"].professors[0]}</p><strong>م18و</strong></div></td><td><div><h4>${data["subjects"]["modern_literature_prose"].name}</h4><p>${data["subjects"]["modern_literature_prose"].professors[1]}</p><strong>م18و</strong></div></td></tr><tr><td><h3>الخميس</h3></td><td></td><td colspan="2"><div><h4>${data["subjects"]["criticism"].name}</h4><p>${data["subjects"]["criticism"].professors[0]}</p><strong>م18و</strong></div></td><td><div><h4>${data["subjects"]["popular_literature"].name}</h4><p>${data["subjects"]["popular_literature"].professors[0]}</p><strong>م18و</strong></div></td><td><div><h4>${data["subjects"]["research_methods"].name}</h4><p>${data["subjects"]["research_methods"].professors[1]}</p><strong>م18و</strong></div></td></tr></tbody></table></div><span>آخر تحديث: 15/02/2023 02:30 ص <img id="refresh" alt="أيقونة التحديث" src="img/refresh.png"></span>`;
            subjects_div.innerHTML = html.length? html.join(""): "<p>لا توجد معلومات.</p>";
        }
    }
};

const detectChange = () => {
    let page = "index";
    if (window.location.search) {
        const searchParams = new URLSearchParams(window.location.search);
        if (searchParams.has("subject")) page = searchParams.get("subject");
    }
    switchPage(page);
};
detectChange();
